{ ... }:
{
  # Module: neovim config
  programs.nvf = {
    enable = true;
    settings = {
      vim = {
        theme = {
          enable = true;
          name = "tokyonight";
          style = "moon";
        };

        dashboard.alpha = {
          enable = true;
          theme = "dashboard";
          # opts = {
          #   section.header.val = [
          #       "                                                     "
          #       "  ███╗   ██╗███████╗ ██████╗ ██╗   ██╗██╗███╗   ███╗ "
          #       "  ████╗  ██║██╔════╝██╔═══██╗██║   ██║██║████╗ ████║ "
          #       "  ██╔██╗ ██║█████╗  ██║   ██║██║   ██║██║██╔████╔██║ "
          #       "  ██║╚██╗██║██╔══╝  ██║   ██║╚██╗ ██╔╝██║██║╚██╔╝██║ "
          #       "  ██║ ╚████║███████╗╚██████╔╝ ╚████╔╝ ██║██║ ╚═╝ ██║ "
          #       "  ╚═╝  ╚═══╝╚══════╝ ╚═════╝   ╚═══╝  ╚═╝╚═╝     ╚═╝ "
          #       "                                                     "
          #   ];
          # };
        };

        mini = {
          files.enable = true;
          completion.enable = true;
          snippets.enable = true;
        };

        statusline.lualine = {
          enable = true;
        };

        options.tabstop = 4;

        lsp.enable = true;
        languages = {
          enableTreesitter = true;

          nix.enable = true;
        };
      };
    };
  };
}
